Sakila Core
by Nokuthula Mchunu

In [18]:
import pymysql
pymysql.install_as_MySQLdb()
#import pandas as pd
from sqlalchemy import create_engine

In [19]:
#dialect+driver://username:password@host:port/database

In [20]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "Lwanda09" # (or whatever password you chose during mysql installation)
db_name = "sakila"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [24]:
q = """SELECT *  FROM customer cus
inner join address a
on a.address_id = cus.address_id 
inner join city c
on a.city_id = c.city_id 
where c.city_id = 312;"""

pd.read_sql(q, engine)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update,address_id,...,address2,district,city_id,postal_code,phone,last_update,city_id,city,country_id,last_update
0,252,2,MATTIE,HOFFMAN,MATTIE.HOFFMAN@sakilacustomer.org,256,1,2006-02-14 22:04:36,2006-02-14 12:57:20,256,...,,England,312,3433,246810237916,2006-02-14 12:45:30,312,London,102,2006-02-14 12:45:25
1,512,1,CECIL,VINES,CECIL.VINES@sakilacustomer.org,517,1,2006-02-14 22:04:37,2006-02-14 12:57:20,517,...,,Ontario,312,35653,879347453467,2006-02-14 12:45:30,312,London,102,2006-02-14 12:45:25

In [27]:
c = """SELECT *  FROM category cat
where name ='Comedy';"""

pd.read_sql(c, engine)

   category_id    name         last_update
0            5  Comedy 2006-02-14 12:46:27